<?php if ( ! defined( 'ABSPATH' ) ) { die; } // Cannot access pages directly.
// ===============================================================================================
// -----------------------------------------------------------------------------------------------
// CUSTOMIZE SETTINGS
// -----------------------------------------------------------------------------------------------
// ===============================================================================================
$options              = array();

// -----------------------------------------
// Customize Core Fields                   -
// -----------------------------------------
$options[]            = array(
  'name'              => 'lazycat',
  'title'             => 'Island密钥验证',
  'settings'          => array(

    // text
    array(
      'name'          => 'lazycat_key',
      'control'       => array(
        'label'       => '密钥',		        'wrap_class'  => 'hide',		        'class'  => 'hide',
        'type'        => 'text',
      ),
    ),

  )
);

CSFramework_Customize::instance( $options );
